# 2. Написать программу, которая будет запрашивать у пользователя его имя и возраст, а затем выводить приветствие “Привет [имя]! Тебе [возраст]”.

# Можно усовершенствовать программу, чтобы она посчитала также количество прожитых месяцев, дней, часов.
# Просить помощи и разъяснений у ChatGPT, чтобы усовершенствовать программу — можно и нужно.

# name1=input('Привет! Как тебя зовут?')
# years1=int(input('Сколько тебе лет?'))
# print(f'Привет, {name1}! Тебе {years1} лет.')

# months = years1 * 12
# days = years1 * 365
# hours = days * 24

# print(f'Представляешь, {years1} лет - это {months} месяцев или {days} дней или {hours} часов!')

# 3. Написать программу, которая будет запрашивать у пользователя две строки с помощью инпутов, а затем производить их конкатенацию.
phrase1=input('Привет! Введи первое предложение: ')
phrase2=input("а теперь введи второе предложение: ")
print(f"{phrase1} {phrase2}")